{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "border_mode": "valid", "nb_row": 4, "input_dtype": "float32", "nb_col": 4, "nb_filter": 32, "b_regularizer": null, "activation": "relu", "batch_input_shape": [null, 18, 272, 1], "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "axis": -1, "beta_regularizer": null, "epsilon": 1e-05, "mode": 0, "gamma_regularizer": null, "trainable": true, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "border_mode": "valid", "nb_row": 3, "nb_filter": 64, "nb_col": 3, "bias": true, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "axis": -1, "beta_regularizer": null, "epsilon": 1e-05, "mode": 0, "gamma_regularizer": null, "trainable": true, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "output_dim": 2048, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "output_dim": 2048, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "output_dim": 273, "b_regularizer": null, "activation": "softmax", "W_regularizer": null, "bias": true}}]}