{
    "keras_version":"1.1.2",
    "class_name":"Sequential",
    "config":[
        {
            "class_name":"Convolution2D",
            "config":{
                "dim_ordering":"tf",
                "nb_col":3,
                "b_regularizer":null,
                "activation":"relu",
                "nb_row":3,
                "W_constraint":null,
                "trainable":true,
                "b_constraint":null,
                "init":"glorot_uniform",
                "subsample":[
                    1,
                    1
                ],
                "name":"convolution2d_1",
                "border_mode":"valid",
                "bias":true,
                "batch_input_shape":[
                    null,
                    10,
                    10,
                    1
                ],
                "activity_regularizer":null,
                "nb_filter":20,
                "W_regularizer":null,
                "input_dtype":"float32"
            }
        },
        {
            "class_name":"MaxPooling2D",
            "config":{
                "dim_ordering":"tf",
                "border_mode":"valid",
                "strides":[
                    2,
                    2
                ],
                "pool_size":[
                    2,
                    2
                ],
                "name":"maxpooling2d_1",
                "trainable":true
            }
        },
        {
            "class_name":"Flatten",
            "config":{
                "name":"flatten_1",
                "trainable":true
            }
        },
        {
            "class_name":"Dense",
            "config":{
                "W_constraint":null,
                "trainable":true,
                "b_regularizer":null,
                "init":"glorot_uniform",
                "output_dim":64,
                "activation":"relu",
                "input_dim":null,
                "bias":true,
                "b_constraint":null,
                "activity_regularizer":null,
                "name":"dense_1",
                "W_regularizer":null
            }
        },
        {
            "class_name":"Dropout",
            "config":{
                "p":0.25,
                "name":"dropout_1",
                "trainable":true
            }
        },
        {
            "class_name":"Dense",
            "config":{
                "W_constraint":null,
                "trainable":true,
                "b_regularizer":null,
                "init":"glorot_uniform",
                "output_dim":64,
                "activation":"relu",
                "input_dim":null,
                "bias":true,
                "b_constraint":null,
                "activity_regularizer":null,
                "name":"dense_2",
                "W_regularizer":null
            }
        },
        {
            "class_name":"Dropout",
            "config":{
                "p":0.25,
                "name":"dropout_2",
                "trainable":true
            }
        },
        {
            "class_name":"Dense",
            "config":{
                "W_constraint":null,
                "trainable":true,
                "b_regularizer":null,
                "init":"glorot_uniform",
                "output_dim":2,
                "activation":"softmax",
                "input_dim":null,
                "bias":true,
                "b_constraint":null,
                "activity_regularizer":null,
                "name":"dense_3",
                "W_regularizer":null
            }
        }
    ]
}