{
    "config":[
        {
            "config":{
                "trainable":true,
                "subsample":[
                    2,
                    2
                ],
                "input_dtype":"float32",
                "W_regularizer":null,
                "nb_col":6,
                "batch_input_shape":[
                    null,
                    30,
                    30,
                    1
                ],
                "bias":true,
                "b_constraint":null,
                "border_mode":"valid",
                "b_regularizer":null,
                "init":"glorot_uniform",
                "nb_filter":15,
                "name":"convolution2d_1",
                "activity_regularizer":null,
                "activation":"relu",
                "nb_row":6,
                "dim_ordering":"tf",
                "W_constraint":null
            },
            "class_name":"Convolution2D"
        },
        {
            "config":{
                "trainable":true,
                "border_mode":"valid",
                "name":"maxpooling2d_1",
                "pool_size":[
                    2,
                    2
                ],
                "dim_ordering":"tf",
                "strides":[
                    2,
                    2
                ]
            },
            "class_name":"MaxPooling2D"
        },
        {
            "config":{
                "trainable":true,
                "name":"flatten_1"
            },
            "class_name":"Flatten"
        },
        {
            "config":{
                "trainable":true,
                "output_dim":128,
                "W_regularizer":null,
                "activation":"relu",
                "input_dim":null,
                "b_constraint":null,
                "bias":true,
                "b_regularizer":null,
                "name":"dense_1",
                "activity_regularizer":null,
                "init":"glorot_uniform",
                "W_constraint":null
            },
            "class_name":"Dense"
        },
        {
            "config":{
                "trainable":true,
                "p":0.25,
                "name":"dropout_1"
            },
            "class_name":"Dropout"
        },
        {
            "config":{
                "trainable":true,
                "output_dim":64,
                "W_regularizer":null,
                "activation":"relu",
                "input_dim":null,
                "b_constraint":null,
                "bias":true,
                "b_regularizer":null,
                "name":"dense_2",
                "activity_regularizer":null,
                "init":"glorot_uniform",
                "W_constraint":null
            },
            "class_name":"Dense"
        },
        {
            "config":{
                "trainable":true,
                "p":0.25,
                "name":"dropout_2"
            },
            "class_name":"Dropout"
        },
        {
            "config":{
                "trainable":true,
                "output_dim":2,
                "W_regularizer":null,
                "activation":"softmax",
                "input_dim":null,
                "b_constraint":null,
                "bias":true,
                "b_regularizer":null,
                "name":"dense_3",
                "activity_regularizer":null,
                "init":"glorot_uniform",
                "W_constraint":null
            },
            "class_name":"Dense"
        }
    ],
    "class_name":"Sequential",
    "keras_version":"1.1.2"
}