{"config": [{"config": {"border_mode": "valid", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 30, 30, 1], "nb_col": 5, "input_dtype": "float32", "trainable": true, "nb_row": 5, "W_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 10, "b_constraint": null, "subsample": [2, 2], "activation": "relu", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "bias": true, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 128}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "bias": true, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 64}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "bias": true, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activation": "softmax", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 2}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}