{"keras_version": "1.1.2", "config": [{"config": {"nb_col": 6, "activation": "relu", "trainable": true, "batch_input_shape": [null, 30, 30, 1], "subsample": [2, 2], "input_dtype": "float32", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "bias": true, "nb_row": 6, "activity_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "b_constraint": null, "nb_filter": 15, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "bias": true, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "output_dim": 64, "bias": true, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "output_dim": 2, "bias": true, "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}