{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "b_regularizer": null, "activation": "relu", "nb_filter": 32, "trainable": true, "border_mode": "valid", "nb_row": 4, "dim_ordering": "tf", "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 18, 272, 1], "bias": true, "name": "convolution2d_1", "nb_col": 4}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 1e-05, "axis": -1, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_1", "mode": 0, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "relu", "nb_filter": 64, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "bias": true, "subsample": [1, 1], "name": "convolution2d_2"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 1e-05, "axis": -1, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_2", "mode": 0, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "relu", "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "output_dim": 2048, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "relu", "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "output_dim": 2048, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "softmax", "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "output_dim": 273, "name": "dense_3"}}]}