{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_1", "nb_col": 4, "batch_input_shape": [null, 18, 272, 1], "b_constraint": null, "nb_filter": 32, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "nb_row": 4, "activation": "relu", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_2", "nb_col": 3, "b_constraint": null, "nb_filter": 64, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "activation": "relu", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "output_dim": 2048, "trainable": true, "W_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "output_dim": 2048, "trainable": true, "W_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "output_dim": 273, "trainable": true, "W_constraint": null, "activation": "softmax"}}], "keras_version": "1.1.2"}