{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "batch_input_shape": [null, 18, 272, 1], "nb_row": 4, "name": "convolution2d_1", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activation": "relu", "border_mode": "valid", "nb_filter": 32, "subsample": [2, 2], "b_constraint": null, "dim_ordering": "tf", "input_dtype": "float32", "activity_regularizer": null, "nb_col": 4, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_row": 3, "b_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "activation": "relu", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activation": "relu", "output_dim": 2048, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activation": "relu", "output_dim": 2048, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activation": "softmax", "output_dim": 273, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "trainable": true}}]}