{"config": [{"config": {"batch_input_shape": [null, 30, 30, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "nb_row": 4, "subsample": [2, 2], "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "nb_filter": 5, "bias": true, "nb_col": 4, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_1", "output_dim": 64, "init": "glorot_uniform", "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_2", "output_dim": 64, "init": "glorot_uniform", "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "activation": "softmax", "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_3", "output_dim": 2, "init": "glorot_uniform", "W_constraint": null, "bias": true}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}