{"config": [{"config": {"W_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 40, 40, 1], "name": "convolution2d_1", "W_constraint": null, "input_dtype": "float32", "b_regularizer": null, "b_constraint": null, "nb_filter": 20, "init": "glorot_uniform", "activation": "relu", "nb_row": 5, "nb_col": 5, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [3, 3], "trainable": true, "name": "maxpooling2d_1", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 128, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_2", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 64, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_3", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "softmax", "output_dim": 2, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}