{"config": [{"config": {"activation": "relu", "nb_row": 4, "W_regularizer": null, "nb_filter": 5, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_col": 4, "W_constraint": null, "b_constraint": null, "input_dtype": "float32", "name": "convolution2d_1", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 30, 30, 1], "border_mode": "valid", "subsample": [2, 2], "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "output_dim": 64, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "output_dim": 64, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "output_dim": 2, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_3", "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}