{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "W_regularizer": null, "nb_col": 4, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "batch_input_shape": [null, 18, 272, 1], "border_mode": "valid", "nb_filter": 32, "b_regularizer": null, "nb_row": 4, "trainable": true, "bias": true, "name": "convolution2d_1", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "nb_row": 3, "trainable": true, "bias": true, "name": "convolution2d_2", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "dense_1", "W_constraint": null, "output_dim": 2048, "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "dense_2", "W_constraint": null, "output_dim": 2048, "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "softmax", "trainable": true, "name": "dense_3", "W_constraint": null, "output_dim": 273, "b_regularizer": null, "bias": true, "b_constraint": null}}], "keras_version": "1.1.2"}