{"config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 18, 272, 1], "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "input_dtype": "float32", "name": "convolution2d_1", "nb_col": 4, "border_mode": "valid", "W_regularizer": null, "trainable": true, "bias": true, "nb_row": 4, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "relu", "b_regularizer": null, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "name": "convolution2d_2", "nb_col": 3, "border_mode": "valid", "W_regularizer": null, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "relu", "subsample": [1, 1], "b_regularizer": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 2048, "name": "dense_1", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 2048, "name": "dense_2", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 273, "name": "dense_3", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}