{"keras_version": "1.1.2", "config": [{"config": {"b_constraint": null, "W_constraint": null, "input_dtype": "float32", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "b_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 18, 272, 1], "nb_col": 4, "bias": true, "nb_row": 4, "activation": "relu", "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "bias": true, "nb_row": 3, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 2048, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"output_dim": 2048, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"output_dim": 273, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activation": "softmax", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential"}