{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 32, "bias": true, "trainable": true, "dim_ordering": "tf", "batch_input_shape": [null, 18, 272, 1], "subsample": [2, 2], "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 4, "name": "convolution2d_1", "nb_col": 4}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "bias": true, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2", "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 2048, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 2048, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 273, "b_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "trainable": true}}], "keras_version": "1.1.2"}